# Задание 7

# Реализовать генератор с помощью функции с ключевым словом yield,
# создающим очередное значение. При вызове функции должен создаваться объект-генератор.
# Функция должна вызываться следующим образом: for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить
# только первые n чисел, начиная с 1! и до n!.

# Подсказка: факториал числа n — произведение чисел от 1 до n.
# Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

from math import factorial


def factorial_generator(n):
    for i in range(1, n+1):
        yield factorial(i)


for i, fact in enumerate(factorial_generator(7), 1):
    print(f"factorial of {i} is equal to {fact}")
